# YOLOv14-Game2Real 🎮🔄🌍
# YOLOv14 with Game-to-Real Domain Adaptation.
#
# Core innovation: DomainAdaptiveLayer + DomainAdversarialLoss
# - Detects game characters (Delta Force, COD, PUBG) as "person"
# - Uses AdaIN to align game/real feature distributions
# - Domain confusion loss makes features domain-invariant
# - Train with GameCharacterStylization augmentation
#
# Usage:
#   model = YOLO('ultralytics/cfg/models/v12/YOLOv14-game2real.yaml')

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone with Domain Adaptation layers
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]               # 1-P2/4
  - [-1, 1, DomainAdaptiveLayer, [128]]              # 2 - Domain Adaptation
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]               # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, DomainAdaptiveLayer, [512]]              # 6 - Domain Adaptation
  - [-1, 1, Conv, [512, 3, 2]]                      # 7-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]]                     # 9-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, A2C2f, [256, False, -1]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]

  - [[15, 18, 21], 1, Detect, [nc]]
