# YOLOv14-Adaptive ðŸ§ ðŸŽ¯
# YOLOv14 with Adaptive Augmentation + Domain Mixup.
#
# Combines ALL innovations:
# - AdaptiveAugmentPolicy: auto-detects scene type and applies optimal aug
# - DomainMixup: blends game/real domains for smooth interpolation
# - ViewEmbedding: adapts to camera perspective automatically
# - DeformableA2C2f: handles geometric distortions on-the-fly
#
# The model itself decides which augmentation/view/distortion strategy
# to use based on input analysis â€?truly adaptive detection.
#
# Usage:
#   model = YOLO('ultralytics/cfg/models/v12/YOLOv14-adaptive.yaml')

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Adaptive backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]                          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]                   # 1-P2/4
  - [-1, 1, ViewEmbedding, [128, 6, 64]]                 # 2 - View Conditioning
  - [-1, 1, DomainAdaptiveLayer, [128]]                  # 3 - Domain Adaptation
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]                   # 5-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, DomainAdaptiveLayer, [512]]                  # 7 - Domain Adaptation
  - [-1, 1, Conv, [512, 3, 2]]                          # 8-P4/16
  - [-1, 4, DeformableA2C2f, [512, True, 4]]            # 9 - Deformable
  - [-1, 1, Conv, [1024, 3, 2]]                         # 10-P5/32
  - [-1, 4, DeformableA2C2f, [1024, True, 1]]           # 11 - Deformable

# Adaptive head with multi-scale fusion
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 2, DeformableA2C2f, [512, False, -1]]          # 14 - Deformable

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 2, DeformableA2C2f, [256, False, -1]]          # 17 - Deformable

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, DeformableA2C2f, [512, False, -1]]          # 20 - Deformable

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]

  - [[17, 20, 23], 1, Detect, [nc]]
