# YOLOv14-MultiView 🚀
# YOLOv14 with Multi-View Conditioning (ViewEmbedding) and
# Adaptive Resolution Pyramid (DynamicScaleRouter).
#
# Designed for drone, BEV/satellite, ground-level, and mixed-view detection.
# Trained with FisheyeDistortion + RandomPerspectiveDistortion augmentations
# and CrossViewConsistencyLoss.
#
# Usage:
#   model = YOLO('YOLOv14-multiview.yaml')

# Parameters
nc: 80  # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLOv14-MultiView backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]             # 1-P2/4
  - [-1, 1, ViewEmbedding, [128, 6, 64]]          # 2 - Multi-View Conditioning
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]             # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]                   # 6-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]               # 7
  - [-1, 1, Conv, [1024, 3, 2]]                  # 8-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]              # 9

# YOLOv14-MultiView head (with DynamicScaleRouter for adaptive resolution)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]                    # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]]             # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]                    # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]]             # 15

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]                   # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]]             # 18

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]                    # cat head P5
  - [-1, 2, C3k2, [1024, True]]                  # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]              # Detect(P3, P4, P5)
