# YOLOv14-Panorama 🚀
# YOLOv14 with Spherical Area-Attention (SphereAAttn) for 360°
# panoramic images and CircularConv for wrap-aware convolutions.
#
# Features:
# - SphereAAttn handles equirectangular projection distortion
# - CircularConv maintains boundary continuity at 0°/360°
# - Training with panoramic fisheye augmentation
#
# Usage:
#   model = YOLO('YOLOv14-panorama.yaml')

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone with spherical attention
backbone:
  - [-1, 1, CircularConv, [64, 3, 2]]            # 0-P1/2 - wrap-aware
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]             # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]             # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]                   # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4, False, 1.0, 0.5]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]]                  # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]              # 8

# Head with spherical attention
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]]             # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, A2C2f, [256, False, -1]]             # 14

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]]             # 17

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]                  # 20

  - [[14, 17, 20], 1, Detect, [nc]]
